(function(window, $) {
    window.serverIP = "http://127.0.0.1:8086";
    // window.serverIP = "http://127.0.0.1:8087";

    // window.serverIP = "http://127.0.0.1:8000";

    window.realUrl = {
        // 用户登录
        logIn: "/farm1/usersServlet/login",
        // 用户注册
        signIn: "/farm1/userServlet/register",
        // 首页商品展示
        home_page_pro_show: "/farm1/categoryServlet/showCategory",
        // cookies登录验证
        verify_cookie: "/farm1/userServlet/verify",
        // 搜索框实时搜索
        real_time_search: "/farm1/productServlet/fuzzyQuery",
        // 搜索框查询关键字类型
        sear_key_type: "/farm1/categoryServlet/keyType",
        // 查询关键字
        sear_key: "/farm1/productServlet/keyQuery",
        // 查询具体的商品信息
        sear_specific_pro: "/farm1/productServlet/productMes",
        // 查询二级分类对应的一级分类名 // 这个接口还没和郭慧的同步
        sear_firstClassify: "/farm1/categoryServlet/returnKey",
        // 接口8 收藏产品
        collect_pro: "/farm1/CollectServlet/insertCollect",
        // 接口9-提交订单
        commit_order: "/commit_order",
        // 接口10 确认页查询
        make_sure_page_search: "/make_sure_page_search"
    };

    // 在哪里用？
    // 首页左边导航栏要用
    // 供应大厅
    // 供应商后台添加商品的时候要用

    window.classify = {
        data: [{
                name: '禽畜肉蛋',
                data: [{
                        name: '肉类',
                        data: [
                            '猪副产品', '牛副产品', '牛肉', '羊副产品', '鸡副产品', '鸭副产品', '鸡肉', '鸭肉', '鹅副产品'
                        ]
                    },
                    {
                        name: '活禽',
                        data: [
                            '鸡', '鸭', '鹅'
                        ]
                    },
                    {
                        name: '活畜',
                        data: [
                            '牛', '生猪'
                        ]
                    },
                    {
                        name: '禽畜苗',
                        data: [
                            '猪苗', '鸡苗', '鹅苗', '鸭苗'
                        ]
                    }, {
                        name: '蛋类',
                        data: [
                            '鸡蛋', '鸭蛋', '鹅蛋', '皮蛋', '咸蛋'
                        ]
                    },
                    {
                        name: '特种类',
                        data: []
                    }
                ]
            },
            {
                name: '水果',
                data: [{
                        name: '柑橘类',
                        data: [
                            '柑桔', '橙子', '柚子', '柠檬', '金桔'
                        ]
                    },
                    {
                        name: '核果仁果类',
                        data: ['苹果', '梨', '樱桃', '鲜枣', '山楂', '毛桃', '石榴', '人参果', '释迦果', '李子', '枇杷', '拐枣', '蜜桃', '罗汉果', '黑老虎', '西梅', '黄桃', '油桃', '红毛丹', '杨梅', '海棠果', '杏', '钙果', '金刺梨', '黄皮果']
                    },
                    {
                        name: '热带水果',
                        data: ['甘蔗', '榴莲', '香蕉', '芒果', '火龙果', '菠萝蜜', '椰子', '龙眼', '菠萝', '潘石榴', '木瓜', '橄榄', '山竹', '荔枝', '莲雾', '牛油果', '杨桃', '蛋黄果', '余甘果', '榴莲蜜', '人心果', '香如蜜', '龙功果', '诺丽果', '妈咪果']
                    },
                    {
                        name: '浆果类',
                        data: ['草莓', '葡萄', '猕猴桃', '百香果', '马蹄', '圣女果', '柿子', '无花果', '蓝莓', '姑娘果', '树葡萄', '沙刺果', '桑葚', '其它浆果', '树莓', '桃金娘', '牛奶果', '酸角', '黑莓', '灯笼果', '蓝靛果', '杈把果', '黑加仑', '野地瓜', '白刺果']
                    },
                    {
                        name: '瓜果类',
                        data: ['西瓜', '哈密瓜', '甜瓜', '八月瓜', '火参果', '九月瓜', '大瓜', '地悄瓜']
                    }
                ]
            },
            {
                name: '蔬菜',
                data: [{
                        name: '葱姜蒜类',
                        data: ['大葱', '生姜', '大蒜', '小葱', '蒜苗', '韭菜', '洋葱', '红葱头', '洋姜', '韭黄', '南姜', '阳荷', '山姜', '野蒜', '沙葱', '风姜', '葱仔']
                    },
                    {
                        name: '根茎菜类',
                        data: ['红薯', '土豆', '山药', '竹笋', '萝卜', '胡萝卜', '芋头', '魔芋', '紫薯', '葛根', '鲜百合', '雪莲果', '芦笋', '木薯', '毛薯', '盘菜', '凉薯', '竹芋', '姜薯', '板薯', '广芋']
                    },
                    {
                        name: '茄果菜类',
                        data: ['辣椒', '鲜玉米', '西红柿', '茄子', '秋葵']
                    },
                    {
                        name: '叶菜类',
                        data: ['白菜', '莴笋', '芹菜', '菜苔', '香菜', '芥菜', '小白菜', '菠菜', '娃娃菜', '儿菜', '生菜', '油麦菜', '油菜', '藜蒿', '空心菜', '茼蒿', '荠菜', '黄心菜', '豆瓣菜', '麻叶菜', '甜菜', '玉兰菜', '萝卜菜']
                    },
                    {
                        name: '食用菌',
                        data: ['香菇', '木耳', '平菇', '羊肚菌', '金针菇', '茶树菇', '竹荪', '蘑菇', '松茸', '大球盖菇', '银耳', '红菇', '榛蘑', '姬松茸', '松蘑', '双孢菇', '草菇', '鹿茸菇', '松露', '松树菌', '杏鲍菇', '猴头菇', '滑子菇', '海鲜菇']
                    },
                    {
                        name: '瓜菜类',
                        data: ['南瓜', '黄瓜', '冬瓜', '西葫芦', '丝瓜', '苦瓜', '佛手瓜', '葫芦', '菜瓜', '金丝绞瓜', '蛇瓜', '杜瓜', '红瓜', '绿宝瓜', '地蒲']
                    }
                ]
            },
            {
                name: '粮油米面',
                data: [{
                    name: '谷类作物',
                    data: ['干玉米', '大米', '稻谷', '高粱', '小麦', '小米', '糯米', '荞麦', '黑米', '燕麦', '大麦', '糙米', '青稞', '大黄米', '红米', '苦荞', '旱稻', '冻米', '紫米', '五谷米']
                }, {
                    name: '油料作物',
                    data: ['花生', '茶籽', '葵花籽', '芝麻', '亚麻籽', '桐籽', '棉籽', '花椒籽', '胡麻籽', '苏籽', '红花籽', '油橄榄', '青刺果', '秋葵子', '油渣果', '印奇果', '油粽子']
                }, {
                    name: '香辛料',
                    data: ['干辣椒', '花椒', '八角', '陈皮', '胡椒', '辣椒粉', '桂皮', '草果', '茴香', '孜然', '胡椒粉', '香砂仁', '姜粉', '花椒粉', '孜然粉', '花椒枝', '八角粉', '桂皮粉', '洋葱粉', '芥菜籽', '香草豆', '沙葱粉', '豆蔻粉']
                }, {
                    name: '豆类作物',
                    data: ['大豆', '红豆', '蚕豆', '绿豆', '黑豆', '芸豆', '干豌豆', '花豆', '江豆', '鹰嘴豆', '竹豆', '油沙豆', '兵豆', '熊猫豆']
                }, {
                    name: '面食米食',
                    data: ['粉', '面条', '饺子', '包子', '汤圆', '米线', '馒头', '面筋', '混沌', '焖子']
                }, {
                    name: '食用油',
                    data: ['豆油', '菜籽油', '山茶油', '花生油', '色拉油', '玉米油', '核桃油', '葵花籽油', '芝麻油', '亚麻籽油', '橄榄油', '棉籽油', '棕榈油', '棉籽油', '花椒油', '红花籽油', '火麻油', '米糠油', '苏籽油', '茶叶籽油', '牡丹籽油', '椰子油', '秋葵油', '黄芥油', '木姜油', '山桐子油']
                }]
            },
            {
                name: '农副加工',
                data: [{
                    name: '坚果',
                    data: ['核桃', '瓜子', '板栗', '巴旦木', '开心果', '松子', '腰果', '夏威夷果', '碧银果', '榛子', '风流果', '杏仁', '麻子', '杏核', '橡子仁', '沙漠果']
                }, {
                    name: '干果',
                    data: ['红枣', '柿饼', '枸杞', '葡萄干', '地瓜干', '蜜饯果铺', '桂圆干', '莲子', '山楂干', '干姜片', '银杏干果', '干柚子皮']
                }, {
                    name: '休闲速食品',
                    data: ['休闲零食', '饼干糕点', '肉类零食', '糖果', '冲调品', '方便速食', '速冻蔬菜', '罐头', '自制果汁']
                }, {
                    name: '肉制品加工',
                    data: ['腊肉', '腊制品', '卤制品', '板鸭', '香肠制品', '丸子制品', '火腿制品', '肉卷', '腌渍制品']
                }, {
                    name: '水产加工',
                    data: ['水产干货', '冷冻水产品', '腌渍水产品']
                }, {
                    name: '蔬菜加工',
                    data: ['脱水蔬菜', '腌制蔬菜', '干笋', '百合干', '酱菜', '榨菜', '咸菜']
                }]
            },
            {
                name: '农资农机',
                data: [{
                        name: '农用机械设备',
                        data: ['耕整机械', '农用拖拉机', '畜牧饲养设备', '收获处理机械', '饲料机械', '植保机械', '运输装卸机械', '播种机械', '食品加工机械', '农机配件', '干燥机械', '栽植机械', '施肥机械', '榨油机械', '碾米机械', '中耕机械', '地膜机械', '清选机械', '磨粉磨浆机械', '屠宰及肉类加工设备', '肥料机械', '脱粒机械', '果蔬机械', '食用菌机械', '发电设备']
                    },
                    {
                        name: '饲料',
                        data: ['糟渣类饲料', '秸秆饲料', '禽畜饲料', '饼粕饲料', '糠麸类饲料', '青贮饲料', '谷物饲料', '饲料添加剂', '蛋白质补充饲料', '干草类饲料', '预混料', '青绿饲料', '配合饲料', '矿物质饲料', '浓缩饲料']
                    },
                    {
                        name: '肥料',
                        data: ['有机肥', '复合肥', '单质肥', '水溶肥', '叶面肥', '生物肥', '控释肥', '缓释肥', '间接肥料']
                    },
                    {
                        name: '农用百货',
                        data: ['炭', '塑料膜', '木材', '花盆容器', '栽培基质', '荷兰网', '育苗防护资材', '剪刀类', '蜂具', '锯', '燃料', '刀具类', '秤', '扫把', '石灰', '农用消毒品', '其它农资', '劳保手套', '电筒', '板凳', '树枝', '木粉']
                    },
                    {
                        name: '农药',
                        data: ['杀菌剂', '杀虫剂', '除草剂', '植物生长调节剂', '杀螨剂', '灭鼠剂', '土壤调理剂', '特异剂']
                    },
                    {
                        name: '大棚及温室',
                        data: ['大鹏设备', '大鹏', '控温通风设备']
                    }
                ]
            },
            {
                name: '种子种苗',
                data: [{
                    name: '水果种苗',
                    data: ['柑桔苗', '葡萄苗', '桃树苗', '李子树苗', '樱桃苗', '苹果树苗', '柚树苗', '枣树苗', '梨树苗', '草莓苗', '柿树苗', '猕猴桃苗', '橙树苗', '石榴树苗', '杨梅树苗', '金桔苗', '无花果树苗', '百香果苗', '桑树苗', '火龙果苗', '枇杷树苗', '荔枝苗', '蓝莓苗', '杏树苗', '菠萝蜜苗']
                }, {
                    name: '蔬菜种子',
                    data: ['辣椒种子', '南瓜种子', '西红柿种子', '豆角种子', '黄瓜种子', '白菜种子', '茄子种子', '冬瓜种子', '大蒜种子', '大葱种子', '丝瓜种子', '萝卜种子', '包菜种子', '韭菜种子', '苦瓜种子', '小葱种子', '西蓝花种子', '花椰菜种子', '芹菜种子', '空心菜种子', '西葫芦种子', '豌豆种子', '四季豆种子', '菠菜种子', '菜苔种子']
                }, {
                    name: '粮油类种子',
                    data: ['玉米种子', '花生种子', '水稻种子', '黄豆种子', '高粱种子', '小麦种子', '八角种子', '芝麻种子', '油菜籽种子', '小米种子', '蚕豆种子', '大麦种子', '荞麦种子', '藜麦种子', '绿豆种子', '燕麦种子', '赤豆种子', '青稞种子']
                }, {
                    name: '苗床小苗',
                    data: ['油茶树苗', '八角树苗', '茶树苗', '核桃苗', '板栗树苗', '桉树苗', '竹苗', '杨树苗', '五指毛树苗', '楠数码你哦', '夏威夷果苗', '五味子苗', '杉木树苗', '黄花梨树苗', '柏树苗', '香榧苗', '构树苗', '枫树苗', '银杏树苗', '榛子苗', '桂花树苗', '樟树苗', '扁桃树苗']
                }, {
                    name: '蔬菜种苗',
                    data: ['辣椒苗', '花椒苗', '洋葱苗', '莲藕种苗', '西红柿苗', '茄子苗', '芹菜苗', '包菜苗', '大葱苗', '山药苗', '佛手瓜苗', '黄瓜种苗', '西蓝花苗', '芦笋苗', '生菜苗', '圣女果苗', '白菜苗', '苦瓜苗', '鱼腥草种苗', '刺老芽秒', '莴笋苗', '阳荷种苗']
                }, {
                    name: '种根种条',
                    data: ['魔芋种子', '土豆种', '红薯种', '葛根种苗', '朱顶红种球', '芋头种', '山药种', '雪莲果种球', '藏红花种球', '百合种球', '紫薯种', '风信子种球', '柿子树接穗', '滴水观音种芋', '山海螺种根', '苦姑娘根', '金叶榆接穗']
                }]
            }, {
                name: '水产',
                data: [{
                        name: '淡水鱼类',
                        data: ['草水', '鲤鱼', '鲫鱼', '黄鳝', '鲢鱼', '泥鳅', '鲈鱼', '塘鲺', '青鱼', '罗非鱼', '鲶鱼', '鲳鱼', '黄颡鱼', '石斑鱼', '巴沙鱼', '鳗鱼', '翘嘴鲌鱼', '银鱼', '鳊鱼', '斗鱼', '画骨鱼', '雄鱼']
                    },
                    {
                        name: '贝类',
                        data: ['牡蛎', '海鲜贝类', '鲍鱼', '扇贝', '蛤蜊', '蚌', '青口', '淡水贝类', '蛏子', '海鲜礼盒装', '珍珠贝', '鸟贝']
                    },
                    {
                        name: '虾类',
                        data: ['小龙虾', '海虾', '龙虾', '对虾', '青虾', '淡水虾', '皮皮虾', '米虾', '基围虾']
                    },
                    {
                        name: '水产种苗',
                        data: ['鱼苗', '虾苗', '蟹苗', '黄鳝苗', '泥鳅苗']
                    },
                    {
                        name: '蟹类',
                        data: ['大闸蟹', '海蟹', '螃蟹', '青蟹', '梭子蟹', '石蟹', '招潮蟹']
                    },
                    {
                        name: '海水鱼类',
                        data: ['带鱼', '黄花鱼', '刀鱼', '比目鱼', '饵料鱼', '金枪鱼', '龙头鱼', '马面鱼', '鳕鱼', '安康鱼', '沙丁鱼', '跳跳鱼', '梭鱼', '沙光鱼', '马哈鱼', '针鱼', '鲑鱼', '辫子鱼', '剑鱼', '黑石斑', '沙甘鱼', '包公鱼', '黄菇鱼']
                    }
                ]
            }
        ]
    };
})(window, jQuery);